In [1]:
import pandas as pd

In [2]:
s = pd.Series(['banana', 42])

In [3]:
s

0    banana
1        42
dtype: object

In [4]:
s = pd.Series(['Wes', 'Creator'], index=['person', 'who'])
s

person        Wes
who       Creator
dtype: object

In [5]:
s.loc['person']

'Wes'

In [6]:
s.iloc[0]

'Wes'

In [7]:
scientists = pd.DataFrame(
    data={'Occupation':['Chemist','Statistician'],
          'Born':['1920-07-25', '1876-06-13'],
          'Died':['1958-04-16', '1937-10-16'],
          'Age':[37,61]},
    index=['Rosaline Franklin','William Gosset'],
    columns=['Occupation', 'Born','Died','Age'])

In [8]:
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [9]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

In [10]:
scientists.columns

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [11]:
scientists = pd.read_csv('../data/scientists.csv')

In [12]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [13]:
ages = scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [14]:
ages = scientists.Age
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [15]:
# scientists['shape']

In [16]:
scientists.shape

(8, 5)

In [17]:
type(ages)

pandas.core.series.Series

In [18]:
ages.mean()

59.125

In [19]:
ages.shape

(8,)

In [20]:
ages.min()

37

In [21]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [22]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [23]:
ages[ages > ages.mean() & ages > 75]

TypeError: cannot compare a dtyped [int64] array with a scalar of type [bool]

In [24]:
ages[(ages > ages.mean()) & (ages > 75)]

2    90
7    77
Name: Age, dtype: int64

In [25]:
ages[(ages > ages.mean()) & ~(ages > 75)]

1    61
3    66
Name: Age, dtype: int64

In [26]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [27]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [28]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [29]:
scientists.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [30]:
# strftime ## google this and python
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [31]:
scientists['born_dt'] = born_datetime

In [32]:
scientists

,Name,Born,Died,Age,Occupation,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30

In [33]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
Name          8 non-null object
Born          8 non-null object
Died          8 non-null object
Age           8 non-null int64
Occupation    8 non-null object
born_dt       8 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 464.0+ bytes

In [34]:
scientists['died_dt'] = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [35]:
# these two do the same thing
# scientists = scientists.drop(['Born', 'Died'], axis=1)
scientists = scientists.drop(['Born', 'Died'], axis='columns')

In [36]:
scientists

                   Name  Age          Occupation    born_dt    died_dt
0     Rosaline Franklin   37             Chemist 1920-07-25 1958-04-16
1        William Gosset   61        Statistician 1876-06-13 1937-10-16
2  Florence Nightingale   90               Nurse 1820-05-12 1910-08-13
3           Marie Curie   66             Chemist 1867-11-07 1934-07-04
4         Rachel Carson   56           Biologist 1907-05-27 1964-04-14
5             John Snow   45           Physician 1813-03-15 1858-06-16
6           Alan Turing   41  Computer Scientist 1912-06-23 1954-06-07
7          Johann Gauss   77       Mathematician 1777-04-30 1855-02-23

In [37]:
scientists['born_dt'] - scientists['died_dt']

0   -13779 days
1   -22404 days
2   -32964 days
3   -24345 days
4   -20777 days
5   -16529 days
6   -15324 days
7   -28422 days
dtype: timedelta64[ns]

In [47]:
scientists.to_csv('scientists_clean.csv', index=False)